<?php

	# 문자열이 깨지기때문에 필수로 셋팅하기
	header("content-type:text/html; charset=utf-8");

	echo "<h2>php에서 사용하는 for문</h2>";

	# 1 2 3 4 5 출력받기

	# 참고) animal.length 처럼 어디전까지 표현하는것은 db에서 할 수 있음
	# 현재 페이지에서는 어디전까지 표현하기

	for($i = 1; $i<6; $i++){
		echo $i." ,";
	}

	/*########### 응용문제1 ###########*/
	echo "<h2>응용문제 1~10</h2>";
	for($i = 1; $i<11; $i++){
		echo $i." ,";
	}


	/*########### 응용문제2 ###########*/
	echo "<h2>응용문제 7~1</h2>";
	for($i = 7; $i>0; $i--){
		echo $i." ,";
	}


	/*########### 응용문제3 ###########*/
	echo "<h2>응용문제 lucky 5번</h2>";
	for($i = 0; $i<5; $i++){
		echo "lucky".' ,';
	}


	/*########### 응용문제3 ###########*/
	echo "<h2>응용문제 text1 4 7</h2>";
	for($i = 1; $i<10; $i+=3){
		echo $i." ,";
	}


	/*########### 응용문제3 ###########*/
	echo "<h2>응용문제 etc10 6 2</h2>";
	for($i = 10; $i>-2; $i-=4){
		echo "etc".$i." ,";
	}

	/*########## 태그 반복하기 ###########*/

	echo "<h2>태그 반복하기, table에서는 tr이 반복됨</h2>";

	echo "<table>";
		for($i=0; $i<5; $i++){
			echo "<tr><td>테이블 사용하기</td></tr>";
		}
	echo "</table>";


	/*####### li 반복하기 #######*/
	echo "<h2>li 반복하기</h2>";

	echo "<ol>";
		for($i=0; $i<5; $i++){
			echo "<li>li태그</li>";
		}
	

	echo "</ol>";
?>